{
  "event_date": "2003-01-25",
  "title": {
    "tr": "İnterneti 10 Dakikada Dize Getiren Solucan: SQL Slammer'ın Yükselişi",
    "en": "The Worm That Crippled the Internet in 10 Minutes: The Rise of SQL Slammer"
  },
  "narrative": {
    "tr": "25 Ocak 2003, Cumartesi sabahı saat 05:30 (UTC) sularında, internetin damarlarında bir anomali belirdi. O an kimsenin farkında olmadığı, sadece 376 byte'lık minicik bir kod parçası, dijital bir veba gibi yayılmaya başladı. Bu, SQL Slammer'dı. Microsoft'un SQL Server 2000 veritabanı yazılımında altı ay önce keşfedilmiş ve yaması yayınlanmış bir arabellek taşması zafiyetini hedef alıyordu. Ancak o cumartesi sabahı, yamanmamış on binlerce sunucu, solucanın kusursuz kurbanları olacaktı. Slammer'ın dehası, basitliğinde ve hızındaydı. Bir diske yazılmaya veya bir e-postaya eklenmeye ihtiyaç duymuyordu; tamamen bellekte yaşıyordu. UDP port 1434 üzerinden rastgele IP adreslerine tek bir paket göndererek kendini kopyalıyordu. Etkisi, katlanarak büyüyen bir çığ gibiydi. İlk dakikalar içinde kurbanlarının sayısı her 8.5 saniyede bir ikiye katlanıyordu. Sadece on dakika sonra, enfekte olmuş sunucuların %90'ından fazlası solucanın kontrolü altına girmişti. Oluşturduğu devasa ve anlamsız ağ trafiği, internetin ana omurgasını adeta tıkadı. Sonuçlar küresel ve yıkıcıydı. Güney Kore, internet ve mobil iletişiminin neredeyse tamamını kaybetti ve ülke dijital bir karanlığa gömüldü. Bank of America'nın 13.000 ATM'i çevrimdışı oldu. Amerika Birleşik Devletleri'nin Seattle kentindeki 911 acil durum servisleri kesintiye uğradı. Continental Havayolları, biletleme ve check-in sistemlerindeki arızalar nedeniyle çok sayıda uçuşunu iptal etmek zorunda kaldı. Slammer'ın bir amacı veya kötü niyetli bir yükü yoktu; dosya silmiyor, şifre çalmıyordu. Yıkımı, tamamen varlığının bir yan ürünüydü: kontrolsüz bir hızla çoğalarak, modern dünyanın dayandığı dijital altyapıyı boğan saf, kaotik bir ağ gürültüsüydü. O gün, siber güvenlik dünyası, bir sistemin ne kadar 'küçük' bir zafiyetinin ne kadar 'büyük' bir küresel felakete yol açabileceğini ve zamanında yama yapmanın hayati önemini acı bir şekilde öğrendi.",
    "en": "Around 05:30 UTC on Saturday, January 25, 2003, an anomaly appeared in the veins of the internet. A tiny piece of code, just 376 bytes long, began to spread like a digital plague, unnoticed at first. This was SQL Slammer. It targeted a buffer overflow vulnerability in Microsoft's SQL Server 2000 database software, a flaw that had been discovered and patched six months prior. But on that Saturday morning, tens of thousands of unpatched servers would become the worm's perfect victims. The genius of Slammer lay in its simplicity and speed. It didn't need to write to a disk or attach itself to an email; it lived entirely in memory. It replicated itself by sending a single packet to random IP addresses over UDP port 1434. The effect was like an exponentially growing avalanche. Within the first few minutes, the number of its victims was doubling every 8.5 seconds. Just ten minutes later, more than 90% of all vulnerable servers were under the worm's control. The immense and meaningless network traffic it generated essentially clogged the main backbone of the internet. The consequences were global and devastating. South Korea lost almost all of its internet and cellular communication, plunging the country into a digital blackout. Bank of America saw 13,000 of its ATMs go offline. The 911 emergency services in Seattle, Washington were disrupted. Continental Airlines had to cancel numerous flights due to failures in its ticketing and check-in systems. Slammer had no purpose or malicious payload; it didn't delete files or steal passwords. Its destruction was purely a byproduct of its existence: pure, chaotic network noise, generated by replicating at an uncontrollable speed, suffocating the digital infrastructure upon which the modern world relied. That day, the cybersecurity world learned the hard way how 'small' a vulnerability could lead to a 'large' global catastrophe and the critical importance of timely patching."
  },
  "metadata": {
    "key_people": [
      "David Litchfield (Vulnerability Discoverer)",
      "Microsoft Security Response Center",
      "CERT Coordination Center (CERT/CC)"
    ],
    "technologies_used": [
      "Microsoft SQL Server 2000",
      "Microsoft SQL Server Desktop Engine (MSDE) 2000",
      "User Datagram Protocol (UDP)"
    ],
    "methods_used": [
      "Buffer Overflow Vulnerability (MS02-039)",
      "In-Memory/Fileless Propagation",
      "Rapid Random IP Scanning",
      "Single-Packet Worm"
    ],
    "significance": {
      "tr": "SQL Slammer, siber güvenlik tarihinde bir dönüm noktasıdır. Yama yönetiminin ne kadar kritik olduğunu ve aylardır mevcut olan bir yamanın uygulanmamasının küresel sonuçlar doğurabileceğini gözler önüne sermiştir. Bellekte yaşayan (dosyasız) kötü amaçlı yazılımların ne kadar hızlı ve tespit edilmesi zor olabileceğini göstermiştir. Yıkıcı bir görev yükü olmasa bile, bir solucanın sadece ağ trafiği oluşturarak dünya çapında altyapıyı (finans, ulaşım, acil servisler) felç edebileceğini kanıtlamıştır. Bu olay, ağ izleme, anomali tespiti ve kurumların siber tehditlere karşı hazırlıklı olma stratejilerinde önemli değişikliklere yol açmıştır.",
      "en": "SQL Slammer is a landmark event in cybersecurity history. It starkly demonstrated the critical importance of patch management and how the failure to apply a patch that had been available for months could have global consequences. It showcased how fast and difficult to detect in-memory (fileless) malware could be. It proved that even without a destructive payload, a worm could paralyze worldwide infrastructure (finance, transportation, emergency services) solely by generating network traffic. This event led to significant changes in network monitoring, anomaly detection, and corporate cybersecurity readiness strategies."
    },
    "sources": [
      "https://www.caida.org/publications/papers/2003/sapphire/sapphire.html",
      "https://www.wired.com/2003/02/slammer-the-first-warhol-worm/",
      "https://www.cisa.gov/news-events/alerts/2003/01/26/sql-slammer-worm",
      "https://news.bbc.co.uk/2/hi/technology/2693951.stm",
      "https://learn.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-039"
    ]
  }
}